//
//  FoodData.swift
//  ThisIsBeijing
//
//  Created by 刘铭 on 2021/2/13.
//

import SwiftUI

// MARK: - FACTS DATA

let foodsData: [Food] = [
  Food(
    image: "爱窝窝-fact-1",
    content: "爱窝窝，北京传统风味小吃，每年农历春节前后，北京的小吃店要上这个品种，一直卖到夏末秋初，所以爱窝窝也属春秋品种，现在一年四季都有供应。"
  ),
  Food(
    image: "扒糕-fact-2",
    content: "是北京小吃中的夏季小吃。扒糕与凉粉一般同时出售。出售时摊贩不时的吆喝：“扒糕筋道……酸辣凉粉儿哟……”"
  ),
  Food(
    image: "百果年糕-fact-3",
    content: "北京春节的传统小吃，早在辽代，据说北京的正月初一，家家就有吃年糕的习俗。年糕有黄、白两色，象征金银，并有“年年高”的吉祥如意的寓意。所以前人有诗称年糕：“年糕寓意稍云深，白色如银黄色金。年岁盼高时时利，虔诚默祝望财临。”"
  ),
  Food(
    image: "爆肚-fact-4",
    content: "北京风味小吃中的名吃，多为回族同胞经营。爆肚早在清乾隆年代就有记载。过去和现时，每当秋末冬初，北京的清真餐馆和摊贩就经营爆肚。北京天桥有“爆肚石”，门框胡同有“爆肚杨”，还有“爆肚冯”、“爆肚满”等最为出名。"
  ),
  Food(
    image: "糖葫芦-fact-5",
    content: "冬春之夜消闲的著名蜜饯。从大小蜜饯店、干鲜店，到街头小贩都制做。而且除名店以外，小贩制品质量超过一般的店家。老北京宁吃街头小贩所售，不吃一般干鲜果店所制。每年的九月底开始，就有小贩走街串巷，有挑担的，有扛稻草桩子的，上面插满冰糖葫芦，一路吆喝着：“芦冰糖，蜜嘞糖葫芦……”"
  ),
  Food(
    image: "驴打滚-fact-6",
    content: "驴打滚，是东北地区、老北京和天津卫传统小吃之一，成品黄、白、红三色分明，煞是好看。因其最后制作工序中撒上的黄豆面，犹如老北京郊外野驴撒欢打滚时扬起的阵阵黄土，因此而得名“驴打滚”。"
  ),
  Food(
    image: "茶汤-fact-7",
    content: "一把大茶汤壶冒着热气，大铜壶金光锃亮，壶身铸有游龙，壶嘴是一个龙头的造型，龙头上面系着两朵丝绒花球，显示它的古雅。大铜壶肚膛内点煤炭，沿着肚膛盛水，茶汤就用烧得滚开的水直接冲入放有茶汤原料的碗内。"
  ),
  Food(
    image: "炒肝-fact-8",
    content: "北京早点的名小吃。每日清晨，卖炒肝的店摊众多，爱喝这一口的人也很多。炒肝那醇厚的美味，真是一大享受。然而炒肝是怎样兴起的，连一些老北京人也都不一定知道。"
  ),
  Food(
    image: "炒疙瘩-fact-9",
    content: "很多人都爱吃，但不少人并不一定知道炒疙瘩是怎样形成和发展的。如果您在品尝北京这个特有的风味美食时，又知道它的来历和一些趣闻，定会增添不少情趣。"
  ),
  Food(
    image: "豆汁-fact-10",
    content: "舒乙先生一次在“南来顺”喝豆汁，叙说了一位香港导演胡金铨说过的话：“谁不能喝豆汁，谁就无资格研究老舍。”无独有偶，京剧表演大师梅兰芳也很喜欢喝豆汁。抗战期间居住上海留须不出，无豆汁可喝，思之若渴，弟子言慧珠自京赴沪演出，特带4斤装大瓶灌满豆汁，以尊师长，传为佳话。"
  ),
  Food(
    image: "褡裢火烧-fact-11",
    content: "“门框胡同瑞宾楼，褡裢火烧是珍馐。外焦里嫩色味美，京都风味誉九州。”这是一位家住郊区的老翁得知瑞宾楼恢复这一北京名食供应后，特让儿孙陪同专程到店品尝时，欣然提笔写下的诗句。"
  ),
  Food(
    image: "豆馅烧饼-fact-12",
    content: "豆馅烧饼又名蛤蟆吐蜜，是北京小吃中的常见品种，因其以豆沙为馅而得名，在烤制过程中，因烧饼边上有自然开口，吐出豆馅，挂着烧饼边上，所以人们就形象地称这种烧饼为蛤蟆吐蜜。"
  )
]
