//
//  SnackBarData.swift
//  ThisIsBeijing
//
//  Created by 刘铭 on 2021/2/14.
//

import SwiftUI

// MARK: - SnackBar DATA

let snackBarsData: [SnackBar] = [
  SnackBar(
    title: "白白糯糯的爱窝窝",
    headline: "爱窝窝，北京传统风味小吃，主料为桃仁、瓜仁、芝麻仁和白糖。",
    image: "爱窝窝-SnackBar",
    rating: 5,
    serves: 4,
    preparation: 20,
    hot: 0,
    introduction: [
      "爱窝窝历史悠久，“爱窝窝”在元代即已有之，名”不落夹”。",
      "因明代帝、后喜食，就成了宫廷与仕宦之家的美味小吃，称”御爱窝窝”。",
      "后来传入民间，衍化为”爱窝窝”，亦作”艾窝窝”。",
      "明万历年间内监刘若愚的《酌中志》中说：“以糯米夹芝麻为凉糕，丸而馅之为窝窝，即古之‘不落夹’是也。”",
      "可见这种食品是用糯米洗净浸泡，尔后入笼屉蒸熟，晾凉后揉匀，揪成小剂，摁成圆皮，包上桃仁、芝麻仁、瓜子仁、青梅、金糕、白糖，拌和成馅，就成了明万历年间称之为窝窝的食品。"
    ],
    method: [
      "主料：山药300克、糯米300克。辅料：枸杞子10粒。调料：椰蓉80克、白糖40克。",
      "1.糯米浸泡12小时；",
      "2.糯米沥干水分，倒入蒸笼中，放入蒸锅中，山药洗净，一起放入蒸锅中；",
      "3.糯米蒸15分钟取出，加凉水，让糯米吸足水分，再次放入蒸锅中，蒸15分钟；",
      "4.山药取出放凉后，去皮，放入保鲜袋中，压成泥，山药泥放入碗中，调入白糖；",
      "5.糯米饭放入保鲜袋中，压碎；取一小碗，放一张保鲜膜，放入糯米饭，用小勺压匀；",
      "6.放入山药泥，提起保鲜膜，包匀；",
      "7.蘸上椰蓉即可食用，上面摆上枸杞子做装饰。"
    ]
  ),
  SnackBar(
    title: "超级火爆的爆肚",
    headline: "北京天桥有“爆肚石”，门框胡同有“爆肚杨”，还有“爆肚冯”、“爆肚满”等最为出名。",
    image: "爆肚-SnackBar",
    rating: 5,
    serves: 12,
    preparation: 10,
    hot: 5,
    introduction: [
      "爆肚也要会吃，不会吃的人顶多吃个牛百叶的脆劲儿，而会吃的人则各有偏好，别的根本不尝。会吃的人还能把各种爆肚的味儿全部吃出来、讲出来。什么是好，爆到几分，都能说出个一五一十。",
      "原来这爆肚还很讲究，不但有用牛肚还有用羊肚的。所谓肚实际上是胃。因为牛羊都是反刍动物，所以胃很发达，也很多(有四个胃)，而且因为经常活动(反刍)所以口感也好许多。相比来说猪的就差多了。",
      "爆肚冯曾号称爆肚分为13个部位，但一般羊肚分为：散丹、肚仁、肚领、蘑菇、和蘑菇尖，牛肚分为：百叶、肚仁和肚领。",
      "一般我们吃的所谓黑百叶就是羊肚，准确地叫法应该是散丹。因为只有牛的才叫百叶。",
      "在旧社会，一般老百姓吃爆肚大多是吃百叶、散丹之类，只有穷人乍富或者不那么有钱的有钱人才会要肚仁、蘑菇来吃。不过好了，这些玩意我们也都可以享用，而且绝对不贵，最贵的蘑菇尖不过是十来块钱。"
    ],
    method: [
      "主料：羊肚500克。辅料：香菜30克。调料：花生油8克、大葱100克、姜15克、大蒜（白皮）20 克、酱油40克、盐3克、味精5克、料酒30克、醋30克、芝麻酱30克、辣椒油10克。",
      "1.洗净：将鲜百叶用清水洗净，清洗时注意撕净肚面上的残留脂肪。",
      "2.切条：将鲜百叶卷起来后，切成7mm左右的细条。",
      "3.制调料：将芝麻酱、醋、生抽、辣椒油、香油、味精、白砂糖少许、白酒少许、豆腐乳和虾油一起放入碗内调匀，撒入香菜末、小葱末。",
      "4.氽制：用大锅装大半锅凉水用火烧沸，加入姜片和大葱段，将鲜百叶放入笊篱中入锅，笊篱迅速摇动打散鲜百叶，大致4-6秒左右，待百叶微微打卷，有微弱弹性了即可捞出，蘸着调料即可食用。"
    ]
  ),
  SnackBar(
    title: "北京烤鸭",
    headline: "烤鸭是具有世界声誉的北京著名菜式，起源于中国南北朝时期，《食珍录》中已记有炙鸭，在当时是宫廷食品。",
    image: "北京烤鸭-SnackBar",
    rating: 4,
    serves: 24,
    preparation: 15,
    hot: 25,
    introduction: [
      "相传，烤鸭之美，是源于名贵品种的北京鸭，它是当今世界最优质的一种肉食鸭。据说，这一特种纯北京鸭的饲养，约起于千年前左右，是因辽金元之历代帝王游猎，偶获此纯白野鸭种，后为游猎而养，一直延续下来，才得此优良纯种，并培育成今之名贵的肉食鸭种。",
      "用填喂方法育肥的一种白鸭，故名“填鸭”。不仅如此，北京鸭曾在百年以前传至欧美，经繁育一鸣惊人。因而，作为优质品种的北京鸭，成为世界名贵鸭种来源已久。",
      "明初年间，老百姓爱吃南京板鸭，皇帝也爱吃，据说明太祖朱元璋就“日食烤鸭一只”。宫廷里的御厨们就想方设法研制鸭馔的新吃法来讨好万岁爷，于是也就研制出了叉烧烤鸭和焖炉烤鸭这两种。",
      "叉烧烤鸭以“全聚德”为代表，而焖炉烤鸭则以“便宜坊”最著名。金陵烤鸭是选用肥大的草鸭为原料，净重要求在2．5公斤左右。",
      "据说，随着明成祖（即朱棣）篡位迁都北京后，也顺便带走了不少南京里烤鸭的高手。",
      "在嘉靖年间，烤鸭就从宫廷传到了民间，老“便宜坊”烤鸭店就在菜市口米市胡同挂牌开业，这也是北京第一家烤鸭店。而当时的名称则叫“金陵片皮鸭”，就在老“便宜坊”的市幌上还特别标有一行小字：金陵烤鸭。",
      "在1864年，京城名气最大的“全聚德”烤鸭店也挂牌开业，烤鸭技术又发展到了“挂炉”时代。它是用果木明火烤制并具有特殊的清香味道，不仅使烤鸭香飘万里而且还使得“北京烤鸭”取代了“南京烤鸭”，而“金陵片皮鸭”只能在港澳、深圳、广州等南方几个大城市的菜单上才能见到。",
      "如今挂炉烤鸭和焖炉烤鸭是北京的烤鸭两大流派。就好像当年北京烤鸭扬弃地改良了山东烤鸭，很多做烤鸭的餐厅，也分别对传统上的这两大流派，做了适合现代口味和消费思想的改进。",
      "北京烤鸭第一种吃法：据说是由大宅门里的太太小姐们兴起的。她们既不吃葱，也不吃蒜，却喜欢将那又酥又脆的鸭皮蘸了细细的白糖来吃。此后，全聚德的跑堂一见到女客来了，便必然跟着烤鸭，上一小碟白糖。",
      "北京烤鸭第二种吃法：甜面酱加葱条，可配黄瓜条、萝卜条，用筷子挑一点甜面酱，抹在荷叶饼上，放几片烤鸭盖在上面，再放上几根葱条、黄瓜条或萝卜条，将荷叶饼卷起，真是美味无比。",
      "北京烤鸭第三种吃法：蒜泥加甜面酱，也可配萝卜条等，用荷叶饼卷食鸭肉也是早年受欢迎的一种佐料。蒜泥可以解油腻，将片好的烤鸭蘸着蒜泥、甜面酱吃，在鲜香中更增添了一丝辣意，风味更为独特。不少顾客特别偏爱这种佐料。"
    ],
    method: [
      "原料处理：选用2.5-3千克健康鸭，采用切断三管法宰杀放血，烫毛用55-60℃水，烫3分钟左右，烫毛、煺毛操作要轻而快，毛煺得干净又不伤皮肤，然后在鸭翅下开一小口，取出内脏，掏膛时动作要快，内脏完整不碎，断去鸭脚和翅膀，然后进行涮膛，把鸭腔、鸭颈、鸭嘴洗涮干净，将回头肠及腔内的软组织取出，要使鸭皮无血污。",
      "1.烫皮挂色：将鸭体用饴糖沸水浇烫，从上至下浇烫3-4次，然后用糖水浇淋鸭身，一般糖水由饴糖与水按1：6-7比例配制。",
      "2.凉坯：将已烫皮挂色的鸭子挂在阴凉、通风处，使鸭子皮肤干燥，一般在春秋季经24小时凉坯，夏季4-6小时。",
      "3.烤制：首先用塞子将鸭子肛门堵住，将开水由颈部刀口处灌入，称为灌汤，然后再打一遍色，然后进入烤炉。北京烤鸭选用的木材以枣木为最好，其次为桃、杏、梨木。木材点燃后，炉温升至200℃以上时，便可以烤鸭了，烤鸭的温度是关键，一般炉温控制在250-300℃之间，在烤制过程中，根据鸭子上色情况，调整鸭子的方位，一般需烤制30分钟左右，烤制也可以根据鸭子出炉时腔内颜色判断烤制的熟度，汤为粉红色时，说明鸭子7-8分熟，浅白色汤时，为9-10分熟，但汤为乳白色时，就说明烤过火了。这一点千万要注意。",
      "4.鸭子出炉后，最好马上刷一层香油，以增加鸭皮的光亮度。"
    ]
  ),
  SnackBar(
    title: "煮出来的炒肝",
    headline: "炒肝具有汤汁油亮酱红，肝香肠肥，味浓不腻，稀而不澥的特色。",
    image: "炒肝-SnackBar",
    rating: 5,
    serves: 12,
    preparation: 5,
    hot: 8,
    introduction: [
      "适宜气血虚弱，面色萎黄，缺铁性贫血者食用；适宜肝血不足所致的视物模糊不清，夜盲．眼干燥症，小儿麻疹病后角膜软化症，内外翳障等眼病者食用；适宜癌症患者及放疗、化疗后食用；适合贫血的人、常在电脑前工作、爱喝酒的人食用；",
      "患有高血压、冠心病、肥胖症及血脂高的人忌食猪肝，因为肝中胆固醇含量较高。有病而变色或有结节的猪肝忌食。",
      "患有高血压、冠心，因为肝中胆固醇含量较高。有病而变色或有结节的猪肝忌食。相据前人经验，猪肝忌与野鸡肉、麻雀肉和鱼肉一同食用。",
      "《随息居饮食谱》：“猪肝明目，治诸血病，余病均忌，平人匆食。”《饮食须知》：“不可合雉肉、雀肉及同鱼脍食，生痈疽。”",
      "猪肝忌与鱼肉、雀肉、荞麦、菜花、黄豆、豆腐、鹌鹑肉、野鸡同食；不宜与豆芽、辣椒、毛豆、山楂等富含维生素C的食物同食；动物肝不宜与维生素C、抗凝血药物、左旋多巴、优降灵和苯乙肼等药物同食。"
    ],
    method: [
      "制作食材：肥肠、猪肝、口蘑汤、猪骨汤、料酒、淀粉、酱油、花椒、大料、桂皮、小茴香、香叶、葱、姜、蒜。",
      "1.肥肠焯水：肥肠处理干净后在锅内倒凉水，凉水中加入肥肠、花椒和料酒待锅开后焯水5分钟。",
      "2.将焯水后的肥肠改刀放入锅中，加水（加水的量以刚刚没过食材为准切忌勿多）、料酒、花椒、大料、桂皮、香叶、小茴香（略多）、葱、姜，煮40分钟，滤掉调料待用。",
      "3.猪肝焯水：将猪肝切薄片，用清水反复冲洗揉搓至无血污（猪肝略带白色为准），锅内倒凉水，凉水中加入花椒待锅开后加入料酒和猪肝20秒后关火（用筷子搅动以便受热均匀）搅动30秒后捞出。",
      "4.炒肝制作：锅中倒入猪骨汤、口蘑汤、煮肥肠汤、肥肠以酱油调色开锅后10分钟，加入猪肝同时调入淀粉勾芡最后多撒些蒜末出锅即可。"
    ]
  ),
  SnackBar(
    title: "豆面滚子驴打滚",
    headline: "驴打滚，是东北地区、老北京和天津卫传统小吃之一，成品黄、白、红三色分明，煞是好看。",
    image: "驴打滚-SnackBar",
    rating: 4,
    serves: 2,
    preparation: 10,
    hot: 1,
    introduction: [
      "豆面卷子起源于东北地区，在北京称驴打滚，是满洲（东北地区，铁岭等地）以及北京小吃中的古老品种之一(满洲地区一般叫豆面卷子）。",
      "它的原料是用黄米面加水蒸熟，和面时稍多加水和软些。源于满洲，缘起于承德，盛行于北京。由于清朝的八旗子弟爱吃粘食，“驴打滚”很快就传到了北京，成为北京的一种风味小吃。",
      "自古以来承德地区就盛产一种黍米，据《热河志·物产》记载：“黍，土人称为黄米”。这种黍米，性粘，承德叫黄米，可闷干饭，或碾成粉用来做粘豆包、年糕和“驴打滚”。",
      "喜吃粘食本来是满族人的传统，因为满族的狩猎生活，经常是早出晚归，吃粘食耐饿。“驴打滚”就是在200多年前从粘食中演变出来的一种大众化小吃。可见“驴打滚”的叫法已约定俗成。",
      "如今，很多人只知雅号俗称，不知其正名了。现各家小吃店一年四季都有供应，但大多数已不用黄米面，改用江米面了，因外滚黄豆粉面，其颜色仍为黄色，是群众非常喜爱的一种小吃。"
    ],
    method: [
      "原料：江米粉、红豆沙、黄豆面",
      "1.把江米粉倒到一个小盆里（量根据吃的人数定，人多的话就多一点，要是有小馋猫在的话，也要多一点），用温水和成面团，拿一个空盘子，在盘底抹一层香油，这样蒸完的面不会粘盘子。将面放在盘中，上锅蒸，大概20分钟左右，前5~10分钟大火，后面改小火。",
      "2.在蒸面的时候炒黄豆面，直接把黄豆面倒到锅中翻炒，炒成金黄色，并有一点点糊味（注：有糊味不等于炒成黑色！）大概炒五分钟左右，出锅。",
      "3.把红豆沙倒出来，放半小碗水，搅拌均匀，待用。",
      "4.待面蒸好（要摊在盘子中，且要蒸熟），拿出，在案板上洒一层黄豆面，把江米面放在上面擀成一个大片，将红豆沙均匀抹在上面（最边上要留一段不要抹），然后从头卷成卷，再在最外层多撒点黄豆面。",
      "5.用刀切成小段（切粘面的时候在刀上沾上清水，就不会粘刀了），在每个小段上再糊一层黄豆面，然后放在盘子里，这样，一盘好吃的驴打滚就出锅。"
    ]
  ),
  SnackBar(
    title: "糖耳朵蜜麻花",
    headline: "蜜麻花是北京小吃中常见名品，又称糖耳朵，因为它成形后形状似人的耳朵得名。",
    image: "蜜麻花-SnackBar",
    rating: 4,
    serves: 12,
    preparation: 10,
    hot: 2,
    introduction: [
      "前人已将蜜麻花的原料讲得很清楚了。不过它用的面要用和好的发酵面对上碱，另用一块面和上红糖，做时将发酵面分两块，一块擀开后，将红糖和的面铺上时，再擀另一块发酵面，铺在红糖面上面，这样成了二层酵面，一层糖面。",
      "用刀切下5厘米左右的长条，将长条一边摁薄，成坡形，把薄边和厚边合到一起，再切成重40克左右小块。自小块中间开一刀口，然后打开，将薄的一面往里翻过去，厚的一边一折，就成了耳朵形的坯子了。",
      "花生油烧五成热，分批将坯子入油里炸过，呈金黄色时捞出，沥尽油，趁热放入温热的饴糖中泡一分钟，称过蜜，浸透后，捞在盘里晾凉就成。要注意必须炸透，否则就会因炸不透，蜜也浸不透的质量不佳现象。",
      "与蜜麻花相似的蜜篦子，原料配制与蜜麻花完全一样，唯形状不同，它是三层擀平，中间竖划几刀，油炸后过蜜而成。",
      "此外还有干糖麻花、芙蓉干糖。干糖麻花不过蜜，芙蓉干糖也不过蜜，而是滚上一层用熟面和白糖混合的糖粉，也都有甜、酥、脆特点。"
    ],
    method: [
      "原料：面、红糖、花生油、碱、饴糖、蜂蜜。",
      "1.面和好发酵面对上碱，另用一块面和上红糖，做时将发酵面分两块，一块擀开后，将红糖和的面铺是上，再擀另一块发酵面，铺在红糖面上面，这样成了二层酵面，一层糖面。",
      "2.用刀切下5厘米左右的长条，将长条一边摁薄，成坡形，把薄边和厚边合到一起，再切成重40克左右的小块。",
      "3.自小块中间开一刀口，然后打开，将薄的一面往里翻过去，厚的一边一折就成了耳朵形的坯子了。",
      "4、花生油烧五成热，分批将坯子入油里炸过呈金黄色时捞出，沥尽油，趁热放入温热的饴糖中泡一分钟，称过蜜，浸透后，捞在盘里晾凉就成了。",
      "要注意必须炸透，否则就会因炸不透，蜜也浸不透的质量不佳现象。"
    ]
  ),
  SnackBar(
    title: "有营养的奶油炸糕",
    headline: "奶油炸糕是一道北京小吃中富有营养的小吃品种。",
    image: "奶油炸糕-SnackBar",
    rating: 5,
    serves: 22,
    preparation: 3,
    hot: 9,
    introduction: [
      "是从牛奶、羊奶中提取的黄色或白色脂肪性半固体食品。",
      "早在公元前3000多年前，古代印度人就已掌握了原始的奶油制作方法。",
      "把牛奶静放一段时间，就会产生一层飘浮的奶皮，奶皮的主要成分是脂肪。",
      "印度人把奶皮捞出装入皮口袋，挂起来反复拍打、搓揉、奶皮便逐渐变成了奶油。但这种方法颇费时间，而且从牛奶中产出的奶油量也很少。",
      "除奶油炸糕外，还有黄米面炸糕和江米面炸糕(用水磨米，质量最好)，面均要加水和好后发酵，面和得不要太硬，要适当揉进一点碱。制作时抓一块面约50-60克，用手指在中间按一个坑儿，包进豆沙馅，将口封严，随包随入温油炸至金黄色。此种炸糕外焦里嫩，香甜可口，很受欢迎。",
      "还有一种烫面炸糕，先把水烧开后，倒人面粉搅拌均匀，面烫好后出锅分成大块，摊开晾凉，对上发面和适量碱面，揉匀揪成小剂，摁扁，包上用红糖、桂花、面干拌匀制成的馅儿，用温油炸。此种炸糕外焦酥，里软嫩，易消化。"
    ],
    method: [
      "原料：水1/2杯(约125ml)，面粉1/2杯(约70克)、鸡蛋2-3个、白糖1大勺、黄油1/2条(约50克)、香草香精1小勺",
      "1.锅中放水1/2杯,黄油1/2条, 白糖1大勺， 烧开后，将面粉倒入，用筷子快速搅拌均匀。",
      "2.将鸡蛋打匀，分次将蛋液倒入烫面内用筷子充分搅均，这一过程比较练臂力。加入香草香精(起到去除蛋腥味，如没有香草香精可不放)，混匀后的面糊即为奶油炸糕的面坯。",
      "3.将油烧热(油温勿过高) ，用两个大的不锈钢勺：先用一个勺挖一坨面糊(大约有鸡蛋黄大小) 用另外一个勺蘸一下油将勺内的面糊轻轻拨进油内，经温油炸至鼓涨起来，呈金黄色即可捞出，沥干油，撒上白糖即可。"
    ]
  ),
  SnackBar(
    title: "老北京炸酱面",
    headline: "炸酱面是中国传统特色面食，被誉为“中国十大面条”之一。",
    image: "炸酱面-SnackBar",
    rating: 5,
    serves: 21,
    preparation: 6,
    hot: 10,
    introduction: [
      "在北方，常见的是猪肉丁炸酱。是以半肥瘦猪肉丁加葱、姜、蒜等在油锅炸炒，加黄稀酱，盖上锅盖小火咕嘟10分钟。当肉丁被黄酱浸透了，肉皮红亮，香味四溢。而讲究的则是用里脊丁炸酱三鲜（虾仁、里脊、玉兰片）炸酱等，还有木樨（鸡蛋）炸酱、炸豆腐丁酱、烧茄子丁酱等素品，油而不腻。",
      "老北京人吃炸酱面，冷天讲究吃热的，谓之“锅儿挑”（完全不过水），热天吃过水面，但汤要篦尽。",
      "根据季节佐以各种时鲜小菜，谓之“全面码儿”。初春，用掐头去尾的豆芽菜（称掐菜）、只有两片子叶的小水萝卜缨，并浇上过年剩下的腊八醋。",
      "春深，在酱里放上鲜花椒蕊儿，称花椒酱，面码儿则是青蒜、香椿芽、掐菜、青豆嘴、小水萝卜缨和丝（条）。初夏则以新蒜、焯过的鲜豌豆、黄瓜丝、扁豆丝、韭菜段等为面码儿。另外，上海、广东、韩国亦有炸酱面。"
    ],
    method: [
      "1.先买一袋干黄酱，如果是两个人的话一小袋即可。；",
      "2.回家把干黄酱倒出来（多少视你的食量而定）放在一个碗里。然后用水（生水就可）慢慢调匀；",
      "3.肉切成小丁（最好是有一点肥的，比较香）丁越小越好;葱切成末，备用；",
      "4.油锅烧热，倒油。多少视你的喜好而定。当然不要太少了，否则粘锅；",
      "5.待油烧热后，放入肉丁，煸一煸；",
      "6.待肉丁八成熟时，把调好的酱倒入锅内。这时的火要调成小火；",
      "7.在小火上慢慢熬酱，用锅铲不断搅动，以免粘锅。同时视酱的稠稀添加适量的水；",
      "8.将切好的葱末倒入锅内，并打两个鸡蛋（半袋干黄酱放两个鸡蛋比较合适）放入酱内，用锅铲搅匀；",
      "9.待酱出香味，色泽变成油亮的微黄色时关火，把酱出锅。（熬酱的时间越长越好，因为就可以把黄酱中的油逼出来了）；",
      "10.吃不了的酱（熬好的），放在碗里，上覆保鲜膜放入冰箱内保存，下次再吃。"
    ]
  )
]
