[
  {
    "id" : "changcheng",
    "name" : "万里长城",
    "headline" : "长城（The GreatWall），又称万里长城，是中国古代的军事防御工事，是一道高大、坚固而且连绵不断的长垣，用以限隔敌骑的行动。长城不是一道单纯孤立的城墙，而是以城墙为主体，同大量的城、障、亭、标相结合的防御体系。",
    "description" : "长城不仅是中国也是世界上修建时间最长、工程量最大的一项古代防御工程，自西周时期开始，延续不断修筑了2000多年，分布于中国北部和中部的广大土地上，总计长度达2万多千米。\n\n自秦始皇以后，凡是统治着中原地区的朝代，几乎都要修筑长城。汉、晋、北魏、东魏、西魏、北齐、北周、隋、唐、宋、辽、金、元、明、清等十多个朝代，都不同规模地修筑过长城。从修筑长城的统治民族看，除汉族之外，许多少数民族统治中国的朝代也修长城，而且比汉族统治的朝代要多。清康熙时期，虽然停止了大规模的长城修筑，但后来也曾在个别地方修筑了长城，可以说自春秋战国时期开始到清代的2000多年一直没有停止过修筑。\n\n据历史文献记载，有20多个诸侯国家和封建王朝修筑过长城，若把各个时代修筑的长城加起来，有10万里以上，其中秦、汉、明三个朝代所修长城的长度都超过了1万里。\n\n中国新疆、甘肃、宁夏、陕西、内蒙古、山西、河北、北京、天津、辽宁、吉林、黑龙江、河南、山东、湖北、湖南等省、市、自治区都有古长城、烽火台的遗迹。",
    "link" : "https://baike.baidu.com/item/%E9%95%BF%E5%9F%8E/14251",
    "image" : "万里长城",
    "gallery" : [
      "万里长城-1",
      "万里长城-2",
      "万里长城-3",
      "万里长城-4"
    ],
    "message" : [
      "长城之称始于春秋战国时期，是长城最通用的称谓。《史记·楚世家》载：“齐宣王乘山岭之上，筑长城，东至海，西至济州，千余里，以备楚。”",
      "称长城建筑为方城，只在春秋时楚国用过。《汉书·地理志》载：“叶，楚叶公邑，有长城，号方城。”",
      "壕堑是长城建筑的一种形式，多指在不易筑墙的地方。"
    ],
  },
  {
    "id" : "guilin",
    "name" : "桂林山水",
    "headline" : "桂林山水是对桂林旅游资源的总称。国家5A级旅游景区，中国十大风景名胜之一，桂林山水是中国山水的代表闻名，千百年来享有“桂林山水甲天下”的美誉。",
    "description" : "人们都说：桂林山水甲天下，阳朔山水甲桂林。桂林，地势北高南低，海拔140～600米，为石灰岩岩溶地区。最早是在儿时的课本“桂林山水”一文中得知的。至今还隐约记得书中的描述──“桂林山水甲天下”、“感到像是走进了连绵不断的画卷”，“这样的山围绕这样的水，这样的水倒映这样的山。”而今，在我亲临桂林之际，桂林以其旖旎的风光向我证明了这一切，书中所述实不为过。2009年，桂林漓江风景区以83公里岩溶水景入选世界纪录协会世界最大的岩溶山水风景区。成为中国旅游的又一世界之最。\n\n桂林处处皆胜景，漓江山水堪称其中的典范。漓江风光尤以桂林阳朔为最，“桂林山水甲天下，阳朔山水甲桂林；群峰倒影山浮水，无山无水不入神”，高度概括了阳朔自然风光的美。我们选择了从阳朔到桂林的路线，逆流畅游漓江。船驶出不久，远远地见到一座峰顶悬挂着一轮初日，缕缕阳光从云中穿过，江中波光粼粼，与群山倒影交相辉映，令人疑是到了仙境。如果说北方的山是豪迈﹑厚重的，那么桂林的山则显得妩媚﹑秀美。玉女峰婷婷玉立，巧梳云鬓；望夫崖凝神远眺，深情守候；赶考的书童，跳龙门的鲤鱼，盘旋的田螺，绿洲的骆驼，形态各异，变化万千，令游人目不暇接。“画山”的九匹马，在导游的引导与娓娓讲述中，更是令桂林的山出神入化到了极点，使游人真切地领略到了桂林山水的神奇﹑秀美。\n\n如果说桂林的山是“鸟鸣山更幽”，那么，桂林的水则是清澈透明﹑绿得欲滴。俯首看去，江水泛着细细的涟漪，玉塔微澜，水色晶莹剔透，加之两岸竹林婀娜多姿，山水相映成趣，怎么看都是一幅长长的山水画，凝重中透露着灵动之气，真是“舟行碧波上，人在画中游”。\n\n站在船头，凭栏望去，漓江上烟波浩渺，令人神思不知所往，冥冥间，在历史的轮回中，我仿佛看到了刘三姐当年对歌的地方，几百年的古树枝繁叶茂，渔舟在水中欢快地游走，人们在田间辛勤地耕种，播撒着收获的希望，往近处一瞧，金发碧眼的外国朋友也来踏青，言语中满含惊羡，欢声笑语不断……这一切不正是一道道更加亮丽的风景线吗?虽然欣赏不到“万户炊烟暮霭浓”的田园风光，但我却看到一个现代化的桂林正在茁壮成长。",
    "link" : "https://baike.baidu.com/item/%E6%A1%82%E6%9E%97%E5%B1%B1%E6%B0%B4/5583",
    "image" : "桂林山水",
    "gallery" : [
      "桂林山水-1",
      "桂林山水-2",
      "桂林山水-3",
      "桂林山水-4"
    ],
    "message" : [
      "象鼻山位于桂林市东南漓江右岸，山因酷似一只大象站在江边伸鼻吸水而得名，是桂林的象征。",
      "龙胜县东南部和平乡境内，有一个规模宏大的梯田群，如链似带，从山脚盘绕到山顶，小山如螺，大山似塔，层层叠叠，高低错落。",
      "猫儿山是“山海经第一山”，招摇山是《山海经》记载的第一座山，招摇山是广西兴安县的猫儿山。",
      "坐落在漓江之畔的独秀峰·王城景区，是以桂林“众山之王”独秀峰为中心，明代靖江藩王府为地域范围的精品旅游景区。"
    ],
  },
  {
    "id" : "gugong",
    "name" : "北京故宫",
    "headline" : "北京故宫是中国明清两代的皇家宫殿，旧称紫禁城，位于北京中轴线的中心。北京故宫以三大殿为中心，占地面积72万平方米，建筑面积约15万平方米，有大小宫殿七十多座，房屋九千余间。",
    "description" : "北京故宫于明成祖永乐四年（1406年）开始建设，以南京故宫为蓝本营建，到永乐十八年（1420年）建成，成为明清两朝二十四位皇帝的皇宫。民国十四年国庆节（1925年10月10日）故宫博物院正式成立开幕。北京故宫南北长961米，东西宽753米，四面围有高10米的城墙，城外有宽52米的护城河。紫禁城有四座城门，南面为午门，北面为神武门，东面为东华门，西面为西华门。城墙的四角，各有一座风姿绰约的角楼，民间有九梁十八柱七十二条脊之说，形容其结构的复杂。\n\n北京故宫内的建筑分为外朝和内廷两部分。外朝的中心为太和殿、中和殿、保和殿，统称三大殿，是国家举行大典礼的地方。三大殿左右两翼辅以文华殿、武英殿两组建筑。内廷的中心是乾清宫、交泰殿、坤宁宫，统称后三宫，是皇帝和皇后居住的正宫。其后为御花园。后三宫两侧排列着东、西六宫，是后妃们居住休息的地方。东六宫东侧是天穹宝殿等佛堂建筑，西六宫西侧是中正殿等佛堂建筑。外朝、内廷之外还有外东路、外西路两部分建筑。\n\n北京故宫是世界上现存规模最大、保存最为完整的木质结构古建筑之一，是国家5A级旅游景区，1961年被列为第一批全国重点文物保护单位；1987年被列为世界文化遗产。\n\n北京原本是燕王朱棣的封地。靖难之役以后，永乐元年（1403年），礼部尚书李至刚等奏称，燕京北平是皇帝“龙兴之地”，应当效仿明太祖对凤阳的做法，立为陪都。明成祖于是大力擢升燕京北平府的地位，以北平为北京，改北平府为顺天府，称为“行在”。同时开始迁发人民以充实北京；被强令迁入北京的有各地流民、江南富户和山西商人等百姓等。\n\n永乐四年（1406年），明成祖下诏以南京皇宫（南京故宫）为蓝本，兴建北京皇宫和城垣。朱棣先派出人员，奔赴全国各地去开采名贵的木材和石料，然后运送到北京。光是准备工作，就持续了11年。珍贵的楠木多生长在崇山峻岭里，百姓冒险进山采木，很多人为此丢了性命，后世留下了“入山一千，出山五百”来形容采木所付出的生命代价。开采修建宫殿的石料，同样很艰辛。保和殿后那块最大的丹陛石，开采于北京西南的房山。史书记载了运送它时的情景：数万名劳工在道路两旁每隔一里左右掘一口井，到了寒冬腊月气温足够低时，就从井里汲水泼成冰道，用了28天的时间，才送到了宫里。此外，还要在苏州烧制专供皇家建筑使用的方砖——金砖，山东临清也要向北京运送贡砖。",
    "link" : "https://baike.baidu.com/item/%E5%8C%97%E4%BA%AC%E6%95%85%E5%AE%AB/345415?fromtitle=%E6%95%85%E5%AE%AB&fromid=9326",
    "image" : "北京故宫",
    "gallery" : [
      "北京故宫-1",
      "北京故宫-2",
      "北京故宫-3",
      "北京故宫-4"
    ],
    "message" : [
      "北京原本是燕王朱棣的封地。靖难之役以后，燕京北平是皇帝“龙兴之地”，应当效仿明太祖对凤阳的做法，立为陪都。",
      "紫禁城建成后，明清宫廷五百多年的历史，包含了帝后活动，等级制度、权力斗争、宗教祭祀等。",
      "崇祯十七年（清顺治元年，1644年），李自成军攻陷北京，明朝灭亡，但李自成很快被清军在山海关击败。"
    ],
  },
  {
    "id" : "xihu",
    "name" : "杭州西湖",
    "headline" : "西湖，位于浙江省杭州市西湖区龙井路1号，杭州市区西部，景区总面积49平方公里，汇水面积为21.22平方公里，湖面面积为6.38平方公里。",
    "description" : "西湖位于浙江省杭州市西湖区龙井路1号，杭州市区西部，景区总面积49平方公里，湖面面积为6.38平方公里，中心地理坐标：北纬30°14′45″，东经120°8′30″。\n\n西湖南、西、北三面环山，东邻城区，南部和钱塘江隔山相邻，湖中白堤、苏堤、杨公堤、赵公堤将湖面分割成若干水面，湖中有三岛，西湖群山以西湖为中心，由近及远可分为四个层次，海拔高度从50至400米依次抬升，形成“重重叠叠山”的地貌景观。西湖与群山的第一层次相连，与后三个层次的距离，分别为1650米、3450米和5600米，在湖中看山景，仰角在5°以内。\n\n西湖汇水面积为21.22平方公里，流域内年径流量为1400万立方米，蓄水量近1400万立方米，水的自然交替为1次/年。西湖的湖体轮廓呈近椭圆形，湖底部较为平坦。湖泊天然地表水源是金沙涧、龙泓涧、赤山涧（慧因涧）、长桥溪四条溪流。湖泊水位保持在黄海标高7.15米，±0.05米，最高水位7.70米，最低水位6.92米，高低相差50厘米。库容量约1429.4万立方米。湖泊平均水深为2.27米，最深约5米，最浅不到1米。湖泊年均湖面降水量562.9万立方米。水系冲刷系数为1.49，当枯水季节闸门封闭时，流速等于0，即使是洪水时期，一般流速也只在0.05米/秒以下。西湖引钱塘江水，量约为1.2亿立方米/年。\n\n西湖地处中国东南丘陵边缘和亚热带北缘，年均太阳总辐射量在100—110千卡/平方厘米之间，日照时数1800—2100小时，光照充足，年均气温16.2℃，年均无霜期245天。常年四季分明，晴雨相间，冬、夏季风交替显著，雨量充沛，年降水量约1500毫米，空气湿润。西湖生态系统可分为三个子系统：森林生态系统、淡水生态系统及湿地生态系统，以森林生态系统为主。",
    "link" : "https://baike.baidu.com/item/%E8%A5%BF%E6%B9%96/4668821?fromtitle=%E6%9D%AD%E5%B7%9E%E8%A5%BF%E6%B9%96&fromid=111124",
    "image" : "杭州西湖",
    "gallery" : [
      "杭州西湖-1",
      "杭州西湖-2",
      "杭州西湖-3",
      "杭州西湖-4"
    ],
    "message" : [
      "西湖断桥位于杭州北里湖和外西湖的分水点上，一端跨着北山路，另一端接通白堤。",
      "雷峰塔又名皇妃塔、西关砖塔，位于西湖南岸夕照山的雷峰上。",
      "苏堤位于西湖西侧，南起南屏山麓，北到栖霞岭下，全长近3公里。"
    ],
  },
  {
    "id" : "suzhouyuanlin",
    "name" : "苏州园林",
    "headline" : "苏州素有“园林之城”的美誉，境内私家园林始建于公元前6世纪，清末时城内外有园林170多处，现存50多处。1997年，苏州古典园林中的拙政园、留园、网师园和环秀山庄被列入世界文化遗产名录；2000年，沧浪亭、狮子林、耦园、艺圃和退思园作为苏州古典园林的扩展项目也被列为世界文化遗产。",
    "description" : "苏州古典园林宅园合一，可赏，可游，可居。这种建筑形态的形成，是在人口密集和缺乏自然风光的城市中，人类依恋自然、追求与自然和谐相处、美化和完善自身居住环境的一种创造。苏州古典园林所蕴涵的中华哲学、历史、人文习俗是江南人文历史传统、地方风俗的一种象征和浓缩，展现了中国文化的精华，在世界造园史上具有独特的历史地位和重大的艺术价值。以拙政园、留园为代表的苏州古典园林被誉为“咫尺之内再造乾坤”，是中华园林文化的翘楚和骄傲。\n\n苏州地处水乡，湖沟塘堰星罗棋布，极利因水就势造园，附近又盛产太湖石，适合堆砌玲珑精巧的假山，可谓得天独厚；苏州地区历代百业兴旺，官富民殷，完全有条件追求高质量的居住环境；加之苏州民风历来崇尚艺术，追求完美，千古传承，长盛不衰，无论是乡野民居，还是官衙贾第，其设计建造皆一丝不苟，独运匠心。这些基本因素大大促进了苏州古典园林的发展。\n\n苏州古典园林的历史可上溯至公元前6世纪春秋时期吴王的园囿，私家园林最早见于现存文字记载的是东晋（4世纪）的辟疆园，当时号称“吴中第一”。以后历代造园兴盛，名园日多，至明代建园之风尤盛，清末时城内外有园林170多处，苏州赢得了“园林之城”的称号。\n\n明清时期，苏州成为中国最繁华的地区之一，私家园林遍布古城内外。在16～18世纪的全盛时期，苏州有园林200余处，保存尚好的有数十处，并因此使苏州素有“人间天堂”的美誉。\n\n明清时期，苏州封建经济文化发展达到鼎盛阶段，造园艺术也趋于成熟，出现了一批园林艺术家，使造园活动达到高潮。最盛时期，苏州的私家园林和庭院达到280余处。\n\n1997年12月4日，联合国世界遗产委员会第21届全体会议批准了以拙政园、留园、网师园、环秀山庄为典型例证的苏州古典园林列入《世界遗产名录》。\n\n2000年11月30日，联合国教科文组织世界遗产委员会第24届会议批准沧浪亭、狮子林、艺圃、耦园、退思园增补列入《世界遗产名录》。",
    "link" : "https://baike.baidu.com/item/%E8%8B%8F%E5%B7%9E%E5%8F%A4%E5%85%B8%E5%9B%AD%E6%9E%97/358248?fromtitle=%E8%8B%8F%E5%B7%9E%E5%9B%AD%E6%9E%97&fromid=62",
    "image" : "苏州园林",
    "gallery" : [
      "苏州园林-1",
      "苏州园林-2",
      "苏州园林-3",
      "苏州园林-4"
    ],
    "message" : [
      "沧浪亭位于苏州市城南三元坊内，是苏州最古老的一所园林。占地面积10800平方米。",
      "拙政园是江南园林的代表，也是苏州古典园林中面积最大的古典山水园林。",
      "留园与北京颐和园、承德避暑山庄、苏州拙政园齐名。坐落在苏州市阊门外，始建于明嘉靖年间（公元1522～1566年）。",
      "环秀山庄位于苏州景德路，全园占地2000平方米左右。始建于唐代末年，原为唐代金谷园故址，宋代为景德寺，明时是宰相申时行的住宅。",
      "狮子林位于苏州城内东北部，始建于元至正二年（公元1342年）。因园内石峰林立，多状似狮子，故名“狮子林”。",
      "艺圃位于苏州阊门内，建于明代。原为药圃，清初改现名，又称敬亭山房。"
    ],
  },
  {
    "id" : "huangshan",
    "name" : "安徽黄山",
    "headline" : "黄山：世界文化与自然双重遗产，世界地质公园，国家5A级旅游景区，国家级风景名胜区，全国文明风景旅游区示范点，中华十大名山，天下第一奇山。",
    "description" : "黄山位于安徽省南部黄山市境内，有72峰，主峰莲花峰海拔1864米，与光明顶、天都峰并称三大黄山主峰，为36大峰之一。黄山是安徽旅游的标志。\n\n黄山原名“黟山”，因峰岩青黑，遥望苍黛而名。后因传说轩辕黄帝曾在此炼丹，故改名为“黄山”。黄山代表景观有“五绝三瀑”，五绝：奇松、怪石、云海、温泉、冬雪；三瀑：人字瀑、百丈泉、九龙瀑。黄山迎客松是安徽人民热情友好的象征，承载着拥抱世界的东方礼仪文化。\n\n明朝旅行家徐霞客登临黄山时赞叹：“薄海内外之名山，无如徽之黄山。登黄山，天下无山，观止矣！”被后人引申为“五岳归来不看山，黄山归来不看岳”。\n\n黄山处于亚热带季风气候区内，山高谷深，气候呈垂直变化，局部地形对气候起主导作用，云雾多、湿度大、降水多，形成特殊的山区季风气候，夏无酷暑，冬少严寒。山顶年均降水2369.3毫米，年均雨日180.6天，多集中于4-6月，积雪日32.9天，雾日259天，大风118.7天，年均温7.9℃，夏季最高气温27℃，冬季最低气温-22℃，最长无雨期40天。景区林木茂密，溪瀑众多，大气质量常年保持Ⅰ级，空气PM2.5日均浓度5微克/立方米，空气负氧离子浓度长年稳定在2万个/cm3以上，有“天然氧吧”之称。\n\n黄山经历了造山运动和地壳抬升，以及冰川和自然风化作用，才形成其峰林结构。黄山有七十二峰，素有“三十六大峰，三十六小峰”之称，主峰莲花峰海拔高达1864.8米，与光明顶、天都峰并称三大黄山主峰，为36大峰之一。\n\n黄山山体主要由燕山期花岗岩构成，垂直节理发育，侵蚀切割强烈，断裂和裂隙交错，长期受水溶蚀，形成花岗岩洞穴与孔道。全山有岭30处、岩22处、洞7处、关2处。黄山的第四纪冰川遗迹主要分布在前山的东南部。\n\n黄山地区共有河流600多条，其中长度在10千米以上的河流有108条。由于黄山山脉横贯全市，将黄山市分为南、北两坡，南坡流域面积大于北坡流域面积，分别为7569.93千米和2264.1千米，各占总面积的76.98%和23.02%。",
    "link" : "https://baike.baidu.com/item/%E8%8B%8F%E5%B7%9E%E5%8F%A4%E5%85%B8%E5%9B%AD%E6%9E%97/358248?fromtitle=%E8%8B%8F%E5%B7%9E%E5%9B%AD%E6%9E%97&fromid=62",
    "image" : "安徽黄山",
    "gallery" : [
      "安徽黄山-1",
      "安徽黄山-2",
      "安徽黄山-3",
      "安徽黄山-4"
    ],
    "message" : [
      "黄山五绝，是指中国安徽省黄山的五种独特景观。分别为：奇松、怪石、云海、温泉、冬雪。",
      "奇松即形态奇特的松树。最著名的黄山松有：迎客松、望客松、送客松、探海松、蒲团松、黑虎松、卧龙松、麒麟松、连理松，这就是黄山的十大名松。",
      "黄山已被命名的怪石有120多处，其形态各异。黄山怪石从不同的位置，在不同的天气观看，可谓“横看成岭侧成峰，远近高低各不同”。",
      "自古黄山云成海，是云雾之乡，其瑰丽壮观的“云海”以美、胜、奇、幻享誉古今，一年四季皆可观、尤以冬季景最佳。依云海分布方位，全山有东海、南海、西海、北海和天海。",
    ],
  },
  {
    "id" : "sanxia",
    "name" : "长江三峡",
    "headline" : "长江三峡西起重庆市奉节县白帝城，东至湖北宜昌市南津关，全长193千米，沿途两岸奇峰陡立、峭壁对峙，自西向东依次为瞿塘峡、巫峡、西陵峡。",
    "description" : "重庆市巫山县境内，有大宁河小三峡、马渡河小小三峡。长江沿线重庆境内，有“水下碑林”白鹤梁，“东方神曲之乡”丰都鬼城，建筑风格奇特的石宝寨、“巴蜀胜境”张飞庙、蜀汉皇帝刘备的托孤堂、龙骨坡巫山文化遗址等景观。\n\n自西向东主要有三个大的峡谷地段：重庆瞿塘峡、重庆巫峡和湖北西陵峡，三峡因而得名。三峡两岸高山对峙，崖壁陡峭，山峰一般高出江面1000-1500米。最窄处不足百米。三峡是由于这一地区地壳不断上升，长江水强烈下切而形成的。\n\n长江三峡属亚热带季风气候区，2001年度（2000年12月～2001年11月）三峡库区气候总体特征为偏旱偏暖。各地年度降水量普遍偏少，气温普遍偏高。与常年相比，库区冬季降水偏多，春、夏、秋季降水持续偏少。年内气温变化较大，与常年相比，冬季、秋季及初春、盛夏气温偏高，仲春、初夏及夏末气温偏低。库区平均风速略小于常年且季节变化不大。\n\n2001年度库区平均降水量为932毫米，较常年偏少1成半以上。库区各地年度降水量为800～1300毫米，均偏少1成半至3成左右。从降水量的地区分布来看，和2000年一样具有中东部多西部少的特点。从时间分布来看，本年度降水量呈双峰型分布，高峰分别出现在6月和10月，10月降水量最大。降水集中期出现在4～8月，但降水量明显少于常年。春季、夏季库区平均降水量分别为239毫米和367毫米，均较常年偏少2成多。秋季库区平均降水量为235毫米，较常年偏少近2成。\n\n三峡库区资源植物类别齐全，种类繁多，约4500多种。其中药用植物3500多种，食用植物610种，油脂植物566种，观赏植物500多种，纤维植物250多种，用材树种300多种，防护林、绿肥植物136种，染料植物50多种，橡胶植物41种，其它用途（如芳香油、栲胶、果类、树脂树胶、色素等）植物480种。\n\n对库区古树的跟踪监测结果表明，古树的总体状况基本稳定。仅发现巴东县铁厂荒林场的一株巴山松（高33.5米，胸径1.6米），因雷击、虫害濒临死亡，重庆市北碚区歇马镇大磨滩河边有1株百年以上的黄角树，因周围环境污染，濒临死亡。",
    "link" : "https://baike.baidu.com/item/%E9%95%BF%E6%B1%9F%E4%B8%89%E5%B3%A1/371964?fromtitle=%E4%B8%89%E5%B3%A1&fromid=23825",
    "image" : "长江三峡",
    "gallery" : [
      "长江三峡-1",
      "长江三峡-2",
      "长江三峡-3",
      "长江三峡-4"
    ],
    "message" : [
      "瞿塘峡，位于重庆奉节县境内，长8公里，是三峡中最短的一个峡。",
      "巫峡，位于重庆巫山县和湖北巴东县两县境内，西起巫山县城东面的大宁河口，东至巴东县官渡口，绵延四十五公里。",
      "西陵峡在湖北宜昌市秭归县境内，西起香溪口，东至南津关，约长66公里，是长江三峡中最长、以滩多水急闻名的山峡。",
      "白鹤梁古称巴子梁，又因白鹤群集梁上而称白鹤梁，是涪陵城区长江之中的天然石梁，长1600米、平均宽度为15米。",
      "丰都县是神曲之乡，道教72洞天福地之一，一座融合了巴渝文化和鬼文化的古城。丰都鬼城以“鬼国京都”、“阴曹地府”闻名于世。",
    ],
  },
  {
    "id" : "riyuetan",
    "name" : "日月潭",
    "headline" : "日月潭位于中国台湾省阿里山以北、能高山之南的南投县鱼池乡水社村，旧称水沙连、龙湖、水社大湖、珠潭、双潭，亦名水里社。2009年，日月潭入选世界纪录协会“中国台湾最大的天然淡水湖”，在清朝时即被选为台湾八大景之一，有“海外别一洞天”之称。",
    "description" : "日月潭是中国台湾风景优美的“天池”，地处玉山山脉之北、能高瀑布之南，介祁於集集大山(潭之西)与水社大山(潭之东)之间。\n\n区内依特色规划有六处主题公园，包括景观、自然、孔雀及蝴蝶、水鸟、宗教等六个主题公园，还有八个特殊景点，以及水社、德化社两大服务区。\n\n日月潭之美在于环湖重峦叠峰，湖面辽阔，潭水澄澈。一年四季，晨昏景色各有不同。7月平均气温不高于22℃，1月不低于15℃，夏季清爽宜人，为避暑胜地。\n\n潭东的水社大山高逾2000米；潭北山腰有一座文武庙；南面青龙山，地势险峻，山麓中有几座寺庙，其中玄奘寺供奉唐代高僧唐玄奘的灵骨；西畔有一座孔雀园，养有数十对孔雀；东南的邵族居民聚落，有专供旅客观赏的民族歌舞表演。",
    "link" : "https://baike.baidu.com/item/%E6%97%A5%E6%9C%88%E6%BD%AD/239702",
    "image" : "日月潭",
    "gallery" : [
      "日月潭-1",
      "日月潭-2",
      "日月潭-3",
      "日月潭-4"
    ],
    "message" : [
      "拉鲁岛（旧名珠屿岛、光华岛）位于日月潭中，以拉鲁岛为界，日月潭分为日潭和月潭。因九二一大地震，岛上建筑多有损坏，全岛也部份沉入水中；2007年开始修复工程。",
      "坐落在日月潭北侧的猫囒山，海拔1020米，是俯瞰日月潭全景及观赏日出的理想地点。",
      "玄光寺寺后，有一条青龙山步道可直达玄奘寺。",
    ],
  },
  {
    "id" : "bishushanzhuang",
    "name" : "承德避暑山庄",
    "headline" : "承德避暑山庄，又名“承德离宫”或“热河行宫”，是世界文化遗产、国家5级旅游景区、全国重点文物保护单位、中国四大名园之一。山庄位于河北省承德市中心北部，武烈河西岸一带狭长的谷地上，是清代皇帝夏天避暑和处理政务的场所。",
    "description" : "避暑山庄的营建，大至分为两个阶段。\n\n第一阶段：从康熙四十二年（1703年）至康熙五十二年（1713年），开拓湖区、筑洲岛、修堤岸，随之营建宫殿、亭树和宫墙，使避暑山庄初具规模。康熙皇帝选园中佳景以四字为名题写了“三十六景”。\n\n第二阶段：从乾隆六年（1741年）至乾隆十九年（1754年），乾隆皇帝对避暑山庄进行了大规模扩建，增建宫殿和多处精巧的大型园林建筑。乾隆仿其祖父康熙，以三字为名又题了“三十六景”，合称为避暑山庄七十二景。\n\n康熙二十年（1681年），清政府为加强对蒙古地方的管理，巩固北部边防，在距北京350多公里的蒙古草原建立了木兰围场。每年秋季，皇帝带领王公大臣、八旗军队、乃至后宫妃嫔、皇族子孙等数万人前往木兰围场行围狩猎，以达到训练军队、固边守防之目的。为了解决皇帝沿途的吃、住，在北京至木兰围场之间，相继修建21座行宫，热河行宫——避暑山庄就是其中之一。避暑山庄及周围寺庙自康熙四十二年（1703年）动工兴建，至乾隆五十七年（公元1792年）最后一项工程竣工，经历了康熙、雍正、乾隆三代帝王，历时89年。在英法联军攻打北京时，咸丰皇帝就带着一批大臣逃到了这里。\n\n康熙五十二年至乾隆四十五年（1713年至1780年），伴随避暑山庄的修建，周围寺庙也相继建造起来。\n\n清朝的康熙、乾隆皇帝时期，每年大约有半年时间要在承德度过，清前期重要的政治、军事、民族和外交等国家大事，都在这里处理。因此，承德避暑山庄也就成了北京以外的陪都和第二个政治中心。乾隆在这里接见并宴赏过厄鲁特蒙古杜尔伯特台吉三车凌、土尔扈特台吉渥巴锡，以及西藏政教首领六世班禅等重要人物，还在此接见过以特使马戛尔尼为首的第一个英国访华使团。清帝嘉庆、咸丰皆病逝于此。1860年，英法联军进攻北京，清帝咸丰逃到避暑山庄避难，在这座房子里批准了《中俄北京条约》等几个不平等条约。影响中国历史进程的“辛酉政变”亦发端于此。随着清王朝的衰落，避暑山庄日渐败落。",
    "link" : "https://baike.baidu.com/item/%E6%89%BF%E5%BE%B7%E9%81%BF%E6%9A%91%E5%B1%B1%E5%BA%84/302784?fromtitle=%E9%81%BF%E6%9A%91%E5%B1%B1%E5%BA%84&fromid=201562",
    "image" : "承德避暑山庄",
    "gallery" : [
      "承德避暑山庄-1",
      "承德避暑山庄-2",
      "承德避暑山庄-3",
      "承德避暑山庄-4"
    ],
    "message" : [
      "康熙时，皇太后来避暑山庄，居住在西峪的松鹤清樾。",
      "正宫是宫殿区的主体建筑，正宫建于康熙五十年至五十二年修建，乾隆十九年（1754年）重新修缮，改建，占地1万平方米。",
      "东宫在松鹤斋的东面，地势比正宫和松鹤斋低。东宫的前面宫墙上另辟大门，称德汇门，为重台城门，形制与丽正门相仿。",
    ],
  },
  {
    "id" : "bingmayong",
    "name" : "兵马俑",
    "headline" : "兵马俑，即秦始皇兵马俑，亦简称秦兵马俑或秦俑，第一批全国重点文物保护单位，第一批中国世界遗产，位于今陕西省西安市临潼区秦始皇陵以东1.5千米处的兵马俑坑内。",
    "description" : "兵马俑是古代墓葬雕塑的一个类别。古代实行人殉，奴隶是奴隶主生前的附属品，奴隶主死后奴隶要作为殉葬品为奴隶主陪葬。兵马俑即制成兵马（战车、战马、士兵）形状的殉葬品。\n\n1961年3月4日，秦始皇陵被国务院公布为第一批全国重点文物保护单位。1974年3月，兵马俑被发现。1987年，秦始皇陵及兵马俑坑被联合国教科文组织批准列入《世界遗产名录》，并被誉为“世界第八大奇迹”，先后有200多位外国元首和政府首脑参观访问，成为中国古代辉煌文明的一张金字名片，被誉为世界十大古墓稀世珍宝之一。\n\n《史记》载：秦始皇陵由丞相李斯依惯例开始主持规划设计，大将章邯监工，修筑时间长达39年之久，兵马俑是修筑秦陵的同时制作并埋入随葬坑内。\n\n秦子婴元年（前206年），秦始皇陵遭遇了第一次也可能是最大一次的劫难。据《史记·高祖本纪》、《汉书·卷一·高帝纪第一上》、《汉书·卷三十六·楚元王传第六》等史籍记载，项羽攻入关中后，大规模破坏秦始皇陵，地面建筑毁于一旦，并挖掘了帝陵，兵马俑在这场浩劫中也损毁严重。考古发掘情况表明，一号俑坑和二号俑坑有黑色木炭遗迹，说明一、二号俑坑的塌陷都是因为被火焚烧后造成的。\n\n秦始皇兵马俑陪葬坑坐西向东，三坑呈品字形排列。最早发现的是一号俑坑，呈长方形，坑里有8000多个兵马俑，四面有斜坡门道。一号俑坑左右两侧各有一个兵马俑坑，称二号坑和三号坑。\n\n兵马俑坑是地下坑道式的土木结构建筑，即从地面挖一个深约5米的大坑，在坑的中间筑起一条条平行的土隔墙。墙的两边排列木质立柱，柱上置横木，横木和土隔墙上密集地搭盖棚木，棚木上铺一层苇席，再覆盖黄土，从而构成坑顶，坑顶高出当时的地表约2米。俑坑的底部用青砖墁铺。坑顶至坑底内部的空间高度为3.2米。陶俑、陶马放进俑坑后，用立木封堵四周的门道，门道内用夯土填实，于是就形成了一座封闭式的地下建筑。",
    "link" : "https://baike.baidu.com/item/%E6%89%BF%E5%BE%B7%E9%81%BF%E6%9A%91%E5%B1%B1%E5%BA%84/302784?fromtitle=%E9%81%BF%E6%9A%91%E5%B1%B1%E5%BA%84&fromid=201562",
    "image" : "兵马俑",
    "gallery" : [
      "兵马俑-1",
      "兵马俑-2",
      "兵马俑-3",
      "兵马俑-4"
    ],
    "message" : [
      "一号坑的发现，缘于1974年3月，兵马俑面世，当时下和村农民在村南打井，井口刚好开在一号坑的东南角。",
      "一号坑是农民打井偶然发现，而二号坑则是考古工作者经过钻探的科学发现。",
      "三号坑的发现，同二号坑一样，是考古队经过钻探的结果。",
      "四号坑有坑无俑，只有回填的泥土，据推测是因为秦末农民起义等原因未建成。",
    ],
  },
]
